app/Controllers/AdminController.php

    public function index()
    {
        $session = session();

        // Fetch all documents
        $documents = $this->documentModel
            ->select('documents.*, users.first_name, users.last_name, users.username')  // Select all fields from both tables
            ->join('users', 'users.id = documents.user_id')  // Join condition on user_id
            ->findAll();
---
SELECT `documents`.*, `users`.`first_name`, `users`.`last_name`, `users`.`username`
FROM `documents`
JOIN `users` ON `users`.`id` = `documents`.`user_id`

    public function updateDocument() {

        helper('form');

        $docId = $this->request->getPost('docId');
        $newStatus = $this->request->getPost('actionType');

        log_message('debug', 'Received docId: ' . $docId);
        log_message('debug', 'Received actionType: ' . $newStatus);

        $data = ['status' => strtolower($newStatus)];

        $updated = $this->documentModel->update($docId, $data);

        if ($updated) {
            // Prepare data for the second table (documentHistoryModel)
            $historyData = [
                'changed_status_at' => date('Y-m-d H:i:s'),  // You can use the current timestamp
            ];

            // Update the document history table
            $this->documentHistoryModel->where('document_id', $docId)
                                       ->update(null, $historyData);
---
UPDATE `documents` SET `status` = 'rejected'
WHERE `documents`.`id` IN ('21')
UPDATE `document_history` SET `changed_status_at` = '2024-12-13 11:47:52'
WHERE `document_id` = '21'

    public function deleteDocument($fileName)
    {
        $filePath = WRITEPATH . 'uploads/' . $fileName;

        if (file_exists($filePath)) {
            // Delete the file from the server
            unlink($filePath);

            $document = $this->documentModel->where('file_name', $fileName)->first();

            $this->documentHistoryModel->where('document_id', $document['id'])->delete();

            // Now delete the corresponding record in the database
            $this->documentModel->where('file_name', $fileName)->delete();
---
SELECT *
FROM `documents`
WHERE `file_name` = '1734090302_5f7aa971c9f549307308.docx'
 LIMIT 1
DELETE FROM `document_history`
WHERE `document_id` = '20'
DELETE FROM `documents`
WHERE `file_name` = '1734090302_5f7aa971c9f549307308.docx'