app/Controllers/ResearcherController.php

    public function index()
    {
        $session = session();

        // Fetch all documents
        // $documents = $this->documentModel
        //     ->where('user_id', $session->get('id'))
        //     ->findAll();

        $documents = $this->documentModel
            ->select(
                'documents.*,
                        users.first_name,
                        users.last_name,
                        users.username,
                        document_history.changed_status_at'
            )
            ->where('users.id', $session->get('id'))
            ->join('users', 'users.id = documents.user_id')
            ->join('document_history', 'documents.id = document_history.document_id') // Corrected the join condition
            ->findAll();
---
SELECT `documents`.*, `users`.`first_name`, `users`.`last_name`, `users`.`username`, `document_history`.`changed_status_at`
FROM `documents`
JOIN `users` ON `users`.`id` = `documents`.`user_id`
JOIN `document_history` ON `documents`.`id` = `document_history`.`document_id`
WHERE `users`.`id` = '7'

    public function uploadDocument()
    {
        $file = $this->request->getFile('documentFile');

        $session = session();

        if($file->isValid() && !$file->hasMoved())
        {
            $extension = $file->getExtension();

            if (!in_array($extension, ['pdf', 'docx'])) {
                return redirect()->to('/researcher-dashboard')->with('error', 'Only PDF and DOCX files are allowed.');
            }

            $file_name = $file->getRandomName();
            $file->move(WRITEPATH . 'uploads/', $file_name);

            $this->documentModel->save([
                'document_name' => $this->request->getPost('documentTitle'),
                'file_name' => $file_name,
                'user_id' => $session->get('id'),
            ]);

            $document = $this->documentModel->where('file_name', $file_name)->first();
---
INSERT INTO `documents` (`document_name`, `file_name`, `user_id`) VALUES ('tests', '1734090322_78a85323aedc9d9fbce9.docx', '7')
SELECT *
FROM `documents`
WHERE `file_name` = '1734090322_78a85323aedc9d9fbce9.docx'
 LIMIT 1