app/Controllers/SharedController.php

SELECT `documents`.*, `users`.`first_name`, `users`.`last_name`, `users`.`username`, `document_history`.`changed_status_at`
FROM `documents`
JOIN `users` ON `users`.`id` = `documents`.`user_id`
JOIN `document_history` ON `documents`.`id` = `document_history`.`document_id`
---
    public function trackingDocument() {
        $session = session();

        // Fetch all documents
        $documents = $this->documentModel
            ->select(
                'documents.*,
                        users.first_name,
                        users.last_name,
                        users.username,
                        document_history.changed_status_at'
            )
            ->join('users', 'users.id = documents.user_id')
            ->join('document_history', 'documents.id = document_history.document_id') // Corrected the join condition// Join condition on documents.id
            ->findAll();

UPDATE `documents` SET `status` = 'approved'
WHERE `documents`.`id` IN ('21')
UPDATE `document_history` SET `changed_status_at` = '2024-12-13 11:48:39'
WHERE `document_id` = '21'
---
    public function updateDocument() {
        helper('form');

        // Get the POST data
        $docId = $this->request->getPost('docId');
        $newStatus = $this->request->getPost('actionType');

        // Log the data
        log_message('debug', 'Received docId: ' . $docId);
        log_message('debug', 'Received actionType: ' . $newStatus);

        // Prepare data for the first table (documentModel)
        $data = ['status' => strtolower($newStatus)];

        // Update document status in the document table
        $updated = $this->documentModel->update($docId, $data);

        if ($updated) {
            // Prepare data for the second table (documentHistoryModel)
            $historyData = [
                'changed_status_at' => date('Y-m-d H:i:s'),  // You can use the current timestamp
            ];

            // Update the document history table
            $this->documentHistoryModel->where('document_id', $docId)
                                       ->update(null, $historyData);