app/Models/UserModel.php

    public function getUserByUsername($username)
    {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'fritzadelan1234'
 LIMIT 1